# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
puts 'Don’t forget to add /usr/local/opt/coreutils/libexec/gnubin to $PATH.'

# Install more recent versions of some OS X tools
tap 'homebrew/dupes'
brew 'bash'
brew 'findutils', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-time', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'less'
brew 'lsof'
brew 'make'
brew 'vim', args: ['override-system-vi']
brew 'whois'

# Install command line utilities
brew 'chruby'
brew 'diff-so-fancy'
brew 'elixir'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'mas'
brew 'node'
brew 'postgresql'
brew 'pt'
brew 'ruby-install'
brew 'rust'
brew 'tree'
brew 'wget', args: ['with-iri']

# Install bash completions
tap 'homebrew/completions'
brew 'bash-completion'
brew 'cargo-completion'
brew 'mix-completion'
brew 'ruby-completion'

# Install native apps
tap 'caskroom/versions'
cask '1password'
cask 'appcleaner'
cask 'dropbox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'google-chrome-beta'
cask 'gpgtools'
cask 'iterm2-beta'
cask 'little-snitch'
cask 'mumble'
cask 'rowanj-gitx'
cask 'slack'
cask 'spectacle'
cask 'sublime-text3'
cask 'torbrowser'
cask 'transmission'
cask 'vlc'

mas 'xScope', id: 447661441
mas 'The Unarchiver', id: 425424353

# Install fonts
tap 'caskroom/fonts'
cask 'font-hack'

