# Install more recent versions of some OS X tools
brew 'coreutils'
brew 'grep'
brew 'gzip'
brew 'less'
brew 'lsof'
brew 'make'
brew 'vim'
brew 'whois'
brew 'zsh'

# Install command line utilities
brew 'diff-so-fancy'
brew 'elixir'
brew 'exa'
brew 'fd'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'hyperfine'
brew 'mas'
brew 'pigz'
brew 'procs'
brew 'ripgrep'
brew 'sd'
brew 'tealdeer'
brew 'tokei'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'zopfli'

# Install native apps
tap 'homebrew/cask-versions'
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'dash'
cask 'discord'
cask 'firefox-developer-edition'
cask 'flux'
cask 'google-chrome-beta'
cask 'gpg-suite-no-mail'
cask 'iterm2'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'vlc'
cask 'xit'

mas 'Affinity Designer', id: 824171161
mas 'Omnifocus 3', id: 1346203938
mas 'The Unarchiver', id: 425424353
mas 'Wipr', id: 1320666476
