# Install more recent versions of some OS X tools
brew 'bash'
brew 'coreutils'
brew 'grep'
brew 'gzip'
brew 'less'
brew 'lsof'
brew 'make'
brew 'vim'
brew 'whois'

# Install command line utilities
brew 'diff-so-fancy'
brew 'elixir'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'kakoune'
brew 'mas'
brew 'node'
brew 'ripgrep'
brew 'ruby'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'yarn'

# Install bash completions
brew 'bash-completion'
brew 'cargo-completion'

# Install native apps
tap 'caskroom/versions'
cask '1password'
cask 'alacritty'
cask 'appcleaner'
cask 'firefox-developer-edition'
cask 'flux'
cask 'google-chrome-beta'
cask 'gpg-suite'
cask 'keybase'
cask 'little-snitch'
cask 'mumble'
cask 'rowanj-gitx'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'torbrowser'
cask 'transmission'
cask 'vlc'

mas 'Xcode', id: 497799835
mas 'xScope', id: 447661441
mas 'The Unarchiver', id: 425424353
